{
  "main": {
    "name": "Brandon Henry",
    "occupation": "React, JavaScript, & Java Developer",
    "description": "My expertise lies in Software Engineering and agile development life-cycles",
    "image": "pp.jpg",
    "bio": "My name is Brandon Henry and I'm a Full Stack React/JS Developer. I received my bachelors in Software Engineering in 2020 and have been developing for over 5 years. My professional profiles outline the various amounts of experience I have gained over the years including working as a Software Engineer at Camgian, interning in the Technology division at Dillard's HQ, and developing several personal projects using React and JS which you can find more about via my GitHub.",
    "contactmessage": "Reach out any time as I love talking about my experiences and current interests in technology.",
    "email": "brandon@claggi.com",
    "phone": "+1 662 549 3074",
    "address": {
      "street": "100 Charleston Dr.",
      "city": "Starkville",
      "state": "MS",
      "zip": "39759"
    },
    "website": "http://www.thebrandonhenry.com",
    "resumedownload": "https://drive.google.com/file/d/1YWk2BgBE0bM0JIUvbnT7_qQV2V-MCdRF/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/officialbhenry",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/the-brandon-henry/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/itsbhenry/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/brandonhenry/",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My skills range from quality assurance, integration testing, and agile development to specific technologies and frameworks such as JavaScript, NodeJS, ReactJS, and more.",
    "education": [
      {
        "school": "Mississippi State University",
        "degree": "Bachelor's Degree, Software Engineer",
        "graduated": "November 2020",
        "gpa": "3.7",
        "description": "Studied core Software Engineer concepts including architecture, design, algorithms, data structures, databases, and more. Organizations include Theta Tau Professional Engineering Fraternity, CSE Department ambassador, and Engineering Student Council."
      },
      {
        "school": "East Mississippi Community College",
        "degree": "Associates Degree, Computer Science",
        "graduated": "May 2017",
        "gpa": "4.0",
        "description": "Graduated from the Honors College summa cum laude. Organizations include Phi Theta Kappa."
      }
    ],
    "work": [
      {
        "company": "Camgian",
        "title": "Software Engineer",
        "years": "Jan 2018 - Dec 2019",
        "description": [
          "During my time at Camgian I gained experience in Quality Assurance testing with both hardware and software. Every sprint cycle, I created unit tests to ensure maximum code coverage. I completed robust outdoor testing and helped maintain large Java codebases working with multiple repositories and shared libraries.",
          "Day to day included working with several project management utilities such as GitLab and JIRA. Additionally, I learned several use cases for git and version control along with multiple commands for interacting with git repositories.",
          "I was the lead developer in new Prowl camera technology. Not only did I design and implement the software architecture to support this new initiative, but I gained experience communicating between software, firmware, and hardware teams. In addition, I helped support testing and demoing of the product to investors.\n\nThis taught me several important concepts surrounding programming including memory management, software development workflows (including scrum and sprint cycles), threading/concurrency, and desktop/web GUI development."
          ]
      },
      {
        "company": "Dillard's Technology",
        "title": "Developer Intern",
        "years": "May 2018 - Aug 2018",
        "description": [
          "Dillard's taught me about coding opportunities in supply chain business operations. I completed my summer internship program at the top of the class, receiving high remarks. Throughout the summer internship, I was able to tackle and understand several programming languages including Java, Javascript, Groovy, Python, COBOL, and SQL.\n\n I was also able to observe corporate-level coding structure and codebases.",
          "During my time there, I interacted with several experienced developers and managers, gaining knowledge in areas such as scripting, inventory management, team management, business relations, and internal corporate tech operations.\n"
          ]
      },
      {
        "company": "Mississippi State University",
        "title": "Teaching Assistant",
        "years": "May 2018 - Aug 2018",
        "description": [
          "While taking classes, I was a Teaching Assistant to Professor Henderson at Mississippi State University for CSE-1233 - Computer Programming with C.",
          "I offered tutoring to students as well as graded homework assignments, quizzes, and tests."
        ]
      }
    ],
    "skills": [
      {
        "name": "ReactJS",
        "level": "100%"
      },
      {
        "name": "Java",
        "level": "95%"
      },
      {
        "name": "Git",
        "level": "75%"
      },
      {
        "name": "JavaScript",
        "level": "100%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "TradeWithMe",
        "category": "ReactJS Web Application",
        "description": "TradeWithMe is a trading assistant for beginner and advanced stock market traders.",
        "image": "TradeWithMe.png",
        "url": "https://github.com/brandonhenry/TradeWithMe"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Brandon is a bright mind and great worker.",
        "position": "Senior Software Engineer at Camgian",
        "user": "James Kemp"
      }
    ]
  }
}
